{
    "<PAD>": 0,
    "ELL": 1,
    "ELS": 2,
    "ILE": 3,
    "LLE": 4,
    "LIE": 5,
    "IRE": 6,
    "GSK": 7,
    "KEL": 8,
    "ERI": 9,
    "SKL": 10,
    "DLL": 11,
    "EKL": 12,
    "LKA": 13,
    "IKD": 14,
    "ELI": 15,
    "LIK": 16,
    "SEE": 17,
    "RKN": 18,
    "NLD": 19,
    "LAE": 20,
    "KEF": 21,
    "EAL": 22,
    "LLD": 23,
    "IEE": 24,
    "LLA": 25,
    "ELK": 26,
    "EEL": 27,
    "KNR": 28,
    "SKS": 29,
    "EIE": 30,
    "GIE": 31,
    "IIE": 32,
    "IDE": 33,
    "GLD": 34,
    "EER": 35,
    "TEL": 36,
    "IKS": 37,
    "LEE": 38,
    "KAV": 39,
    "KTL": 40,
    "GGG": 41,
    "AVA": 42,
    "LID": 43,
    "KDK": 44,
    "IEK": 45,
    "IGK": 46,
    "LDF": 47,
    "TDG": 48,
    "LEL": 49,
    "IAL": 50,
    "EII": 51,
    "DFL": 52,
    "DIF": 53,
    "RSL": 54,
    "IEV": 55,
    "AGL": 56,
    "LDS": 57,
    "IDI": 58,
    "EFK": 59,
    "EEA": 60,
    "DFA": 61,
    "LDK": 62,
    "LVD": 63,
    "ENL": 64,
    "LER": 65,
    "EKE": 66,
    "IKE": 67,
    "KLE": 68,
    "IEN": 69,
    "LLG": 70,
    "AIE": 71,
    "VEA": 72,
    "GLL": 73,
    "LRE": 74,
    "DDV": 75,
    "KKL": 76,
    "KNI": 77,
    "LLK": 78,
    "NIL": 79,
    "VDY": 80,
    "EAI": 81,
    "AIR": 82,
    "ELE": 83,
    "IAE": 84,
    "DIL": 85,
    "SLI": 86,
    "TKK": 87,
    "GIL": 88,
    "DAI": 89,
    "EEI": 90,
    "FDF": 91,
    "ADL": 92,
    "LYL": 93,
    "RLS": 94,
    "SKD": 95,
    "LTE": 96,
    "LKK": 97,
    "SLK": 98,
    "LEN": 99,
    "GVE": 100,
    "LKE": 101,
    "DYV": 102,
    "SGS": 103,
    "KKG": 104,
    "LGI": 105,
    "KNL": 106,
    "IEI": 107,
    "LEK": 108,
    "FSK": 109,
    "ITD": 110,
    "KLI": 111,
    "ILK": 112,
    "IDL": 113,
    "SIK": 114,
    "LSS": 115,
    "SSE": 116,
    "IES": 117,
    "LKS": 118,
    "KIK": 119,
    "INL": 120,
    "KEE": 121,
    "ALI": 122,
    "DKI": 123,
    "IET": 124,
    "ETN": 125,
    "SYL": 126,
    "GLE": 127,
    "KLK": 128,
    "TGL": 129,
    "ALL": 130,
    "LVE": 131,
    "DLA": 132,
    "DEL": 133,
    "VGL": 134,
    "ENI": 135,
    "LSL": 136,
    "KEI": 137,
    "IKK": 138,
    "SEL": 139,
    "SDL": 140,
    "LQS": 141,
    "LIS": 142,
    "NII": 143,
    "ERL": 144,
    "EKI": 145,
    "NKI": 146,
    "IKN": 147,
    "LAK": 148,
    "KSF": 149,
    "ISK": 150,
    "NRS": 151,
    "VFN": 152,
    "LIA": 153,
    "EKA": 154,
    "LTL": 155,
    "SIL": 156,
    "AKS": 157,
    "AEL": 158,
    "LAT": 159,
    "LSN": 160,
    "YLI": 161,
    "VER": 162,
    "KKA": 163,
    "SAL": 164,
    "KGK": 165,
    "VKN": 166,
    "LSA": 167,
    "KLL": 168,
    "YLT": 169,
    "ENK": 170,
    "NLL": 171,
    "KQI": 172,
    "GKN": 173,
    "DLF": 174,
    "EVG": 175,
    "VKA": 176,
    "KAF": 177,
    "DVL": 178,
    "ADI": 179,
    "DIE": 180,
    "LST": 181,
    "AEK": 182,
    "DEE": 183,
    "KKF": 184,
    "FTE": 185,
    "EIK": 186,
    "EAF": 187,
    "NYY": 188,
    "ERR": 189,
    "LEF": 190,
    "RLI": 191,
    "ELY": 192,
    "KDL": 193,
    "KNS": 194,
    "KKI": 195,
    "LLS": 196,
    "FKE": 197,
    "DFI": 198,
    "EAK": 199,
    "LSK": 200,
    "EVK": 201,
    "LKL": 202,
    "EFE": 203,
    "EIL": 204,
    "FSE": 205,
    "LNT": 206,
    "ATA": 207,
    "SNA": 208,
    "IED": 209,
    "VAR": 210,
    "KSL": 211,
    "GKA": 212,
    "SIT": 213,
    "VLT": 214,
    "DKS": 215,
    "DML": 216,
    "LLQ": 217,
    "KNE": 218,
    "EGI": 219,
    "VYG": 220,
    "YFD": 221,
    "KID": 222,
    "LKN": 223,
    "KEY": 224,
    "LPL": 225,
    "LEI": 226,
    "VPV": 227,
    "FYS": 228,
    "EFT": 229,
    "NRT": 230,
    "LET": 231,
    "GAG": 232,
    "LRT": 233,
    "FEL": 234,
    "FLS": 235,
    "YLG": 236,
    "DVK": 237,
    "PSL": 238,
    "EKY": 239,
    "EFI": 240,
    "AEA": 241,
    "VSS": 242,
    "RRF": 243,
    "LNE": 244,
    "NEL": 245,
    "DLI": 246,
    "LSR": 247,
    "VAG": 248,
    "KDI": 249,
    "DDI": 250,
    "GKL": 251,
    "RFD": 252,
    "NGK": 253,
    "ETI": 254,
    "YGV": 255,
    "PVD": 256,
    "LIG": 257,
    "ETL": 258,
    "SGT": 259,
    "LPI": 260,
    "LKT": 261,
    "TGI": 262,
    "ILS": 263,
    "LSQ": 264,
    "NLN": 265,
    "AKN": 266,
    "ITE": 267,
    "TVA": 268,
    "SGK": 269,
    "LLT": 270,
    "SSR": 271,
    "LII": 272,
    "IEA": 273,
    "KLS": 274,
    "LSE": 275,
    "SEK": 276,
    "GKE": 277,
    "LNK": 278,
    "SKK": 279,
    "KEN": 280,
    "DKL": 281,
    "EKN": 282,
    "NKL": 283,
    "AII": 284,
    "FEE": 285,
    "NRI": 286,
    "NEA": 287,
    "RVL": 288,
    "FED": 289,
    "KSN": 290,
    "SNL": 291,
    "LDL": 292,
    "AKV": 293,
    "DFY": 294,
    "AVR": 295,
    "GKI": 296,
    "KII": 297,
    "EEV": 298,
    "KNK": 299,
    "RTG": 300,
    "YLL": 301,
    "FNL": 302,
    "FDN": 303,
    "GGS": 304,
    "GKD": 305,
    "EDK": 306,
    "RLK": 307,
    "FEK": 308,
    "LLN": 309,
    "KST": 310,
    "FIK": 311,
    "ATG": 312,
    "EVN": 313,
    "KAQ": 314,
    "NFV": 315,
    "NKN": 316,
    "DSN": 317,
    "EYG": 318,
    "REK": 319,
    "DII": 320,
    "IPS": 321,
    "RYL": 322,
    "IEL": 323,
    "ESI": 324,
    "ALD": 325,
    "YSL": 326,
    "LQN": 327,
    "EID": 328,
    "DIR": 329,
    "KLV": 330,
    "KAI": 331,
    "REL": 332,
    "NYL": 333,
    "KSD": 334,
    "AIN": 335,
    "DRL": 336,
    "KRL": 337,
    "RET": 338,
    "ILN": 339,
    "VIE": 340,
    "KLY": 341,
    "FIT": 342,
    "KTF": 343,
    "SAI": 344,
    "LFT": 345,
    "KLT": 346,
    "EET": 347,
    "TLS": 348,
    "AAV": 349,
    "KKY": 350,
    "DIK": 351,
    "TLN": 352,
    "ESK": 353,
    "ARK": 354,
    "SSI": 355,
    "KIE": 356,
    "VTD": 357,
    "SLV": 358,
    "LHD": 359,
    "EYL": 360,
    "EDF": 361,
    "VFS": 362,
    "ITK": 363,
    "DLV": 364,
    "DKK": 365,
    "KFD": 366,
    "DAL": 367,
    "FIN": 368,
    "LKI": 369,
    "SER": 370,
    "LKQ": 371,
    "VAD": 372,
    "SLL": 373,
    "YEL": 374,
    "IYK": 375,
    "NDL": 376,
    "YVD": 377,
    "LKD": 378,
    "SYE": 379,
    "SVT": 380,
    "KNN": 381,
    "GIV": 382,
    "NTL": 383,
    "GEF": 384,
    "KDN": 385,
    "VDL": 386,
    "AVF": 387,
    "DNL": 388,
    "DRI": 389,
    "VNF": 390,
    "RAG": 391,
    "RSG": 392,
    "NLQ": 393,
    "FVW": 394,
    "KAR": 395,
    "VID": 396,
    "TKL": 397,
    "AIG": 398,
    "GTT": 399,
    "LEA": 400,
    "ALR": 401,
    "LDD": 402,
    "LAI": 403,
    "NRL": 404,
    "GIG": 405,
    "QIE": 406,
    "KYP": 407,
    "VEE": 408,
    "SFK": 409,
    "EIT": 410,
    "LTD": 411,
    "KER": 412,
    "EEY": 413,
    "IAS": 414,
    "TNF": 415,
    "KGR": 416,
    "EVP": 417,
    "GDL": 418,
    "SSS": 419,
    "AKE": 420,
    "KPL": 421,
    "NIS": 422,
    "ISS": 423,
    "QLA": 424,
    "EAY": 425,
    "KVE": 426,
    "VRE": 427,
    "ERV": 428,
    "YGL": 429,
    "AKL": 430,
    "EIY": 431,
    "LIL": 432,
    "QIK": 433,
    "ELN": 434,
    "ESL": 435,
    "LAL": 436,
    "KAL": 437,
    "QSA": 438,
    "DGQ": 439,
    "EAT": 440,
    "ADA": 441,
    "DVA": 442,
    "EAA": 443,
    "LVS": 444,
    "YLA": 445,
    "LSI": 446,
    "KSK": 447,
    "VVI": 448,
    "GKT": 449,
    "ALS": 450,
    "SFS": 451,
    "KTD": 452,
    "ILG": 453,
    "EKS": 454,
    "FLK": 455,
    "FNK": 456,
    "AKI": 457,
    "AGD": 458,
    "DGE": 459,
    "ISD": 460,
    "LNL": 461,
    "KVF": 462,
    "EEK": 463,
    "LNI": 464,
    "TFE": 465,
    "YVY": 466,
    "ELA": 467,
    "DGF": 468,
    "ALV": 469,
    "AEI": 470,
    "FGN": 471,
    "DLG": 472,
    "VKK": 473,
    "TPE": 474,
    "IPV": 475,
    "PKA": 476,
    "NNP": 477,
    "WGI": 478,
    "ELG": 479,
    "NPD": 480,
    "QRL": 481,
    "GQG": 482,
    "NLI": 483,
    "LIN": 484,
    "DIV": 485,
    "ITR": 486,
    "QNA": 487,
    "ALK": 488,
    "EYI": 489,
    "IIA": 490,
    "NSS": 491,
    "VEK": 492,
    "TLL": 493,
    "LED": 494,
    "LDI": 495,
    "LLL": 496,
    "GLK": 497,
    "GEI": 498,
    "SNV": 499,
    "GSD": 500,
    "SLP": 501,
    "LTV": 502,
    "LYE": 503,
    "LFA": 504,
    "DLR": 505,
    "AHL": 506,
    "SEI": 507,
    "DSL": 508,
    "KAN": 509,
    "ELF": 510,
    "TLD": 511,
    "SLR": 512,
    "AIP": 513,
    "SDE": 514,
    "LNS": 515,
    "FDV": 516,
    "KSE": 517,
    "RIV": 518,
    "RLE": 519,
    "IQE": 520,
    "DDS": 521,
    "LES": 522,
    "MLK": 523,
    "IVE": 524,
    "NAS": 525,
    "AGE": 526,
    "LSD": 527,
    "DVI": 528,
    "RTV": 529,
    "KFE": 530,
    "FER": 531,
    "REE": 532,
    "KLF": 533,
    "IKT": 534,
    "KIS": 535,
    "ELV": 536,
    "VKD": 537,
    "ISA": 538,
    "FGI": 539,
    "NNN": 540,
    "RIK": 541,
    "KIF": 542,
    "TSN": 543,
    "LFK": 544,
    "LNQ": 545,
    "VEL": 546,
    "IKL": 547,
    "KVA": 548,
    "KIT": 549,
    "ITN": 550,
    "LGY": 551,
    "NKK": 552,
    "QIR": 553,
    "SDF": 554,
    "IYD": 555,
    "LLF": 556,
    "YVN": 557,
    "SQF": 558,
    "GFG": 559,
    "LDT": 560,
    "YTD": 561,
    "STD": 562,
    "LYN": 563,
    "EEF": 564,
    "KSG": 565,
    "KKN": 566,
    "ERT": 567,
    "PIL": 568,
    "IFL": 569,
    "TME": 570,
    "YYV": 571,
    "DYY": 572,
    "ALE": 573,
    "KLW": 574,
    "LLV": 575,
    "AAL": 576,
    "AFG": 577,
    "RIP": 578,
    "LQL": 579,
    "DLE": 580,
    "LPK": 581,
    "RIG": 582,
    "LVK": 583,
    "RED": 584,
    "DAT": 585,
    "LIR": 586,
    "LGL": 587,
    "ALF": 588,
    "EQL": 589,
    "LDM": 590,
    "NLA": 591,
    "RDD": 592,
    "SPK": 593,
    "LNN": 594,
    "NVK": 595,
    "PFI": 596,
    "DKF": 597,
    "PDI": 598,
    "KYL": 599,
    "SLF": 600,
    "ERS": 601,
    "FKK": 602,
    "LPP": 603,
    "VPS": 604,
    "NLS": 605,
    "NEV": 606,
    "ATS": 607,
    "EKK": 608,
    "IIL": 609,
    "ANA": 610,
    "NAR": 611,
    "REA": 612,
    "ILD": 613,
    "LFD": 614,
    "SRT": 615,
    "SFE": 616,
    "GEV": 617,
    "QAT": 618,
    "ELR": 619,
    "RDF": 620,
    "SAV": 621,
    "LGK": 622,
    "LRK": 623,
    "KAK": 624,
    "SPS": 625,
    "GWK": 626,
    "LEV": 627,
    "TAP": 628,
    "RGK": 629,
    "KFL": 630,
    "RER": 631,
    "IFK": 632,
    "YSK": 633,
    "FKI": 634,
    "IIS": 635,
    "ISI": 636,
    "VRD": 637,
    "DEI": 638,
    "NKE": 639,
    "IIK": 640,
    "YNL": 641,
    "ISE": 642,
    "VIK": 643,
    "KQG": 644,
    "TNR": 645,
    "IVD": 646,
    "IIN": 647,
    "KLA": 648,
    "NIK": 649,
    "KDE": 650,
    "GGL": 651,
    "LFS": 652,
    "KLP": 653,
    "FLE": 654,
    "SAK": 655,
    "TDY": 656,
    "RSY": 657,
    "TEV": 658,
    "KNG": 659,
    "ETK": 660,
    "SIS": 661,
    "SKN": 662,
    "TNY": 663,
    "LAG": 664,
    "KIL": 665,
    "YDL": 666,
    "TKS": 667,
    "WLI": 668,
    "ILL": 669,
    "FEI": 670,
    "NGR": 671,
    "AQA": 672,
    "QFI": 673,
    "ERK": 674,
    "IIR": 675,
    "RLV": 676,
    "TEE": 677,
    "HDL": 678,
    "SRA": 679,
    "SLQ": 680,
    "KGI": 681,
    "FVE": 682,
    "LPD": 683,
    "ITP": 684,
    "GQL": 685,
    "EVL": 686,
    "KIA": 687,
    "IDK": 688,
    "NKY": 689,
    "RLL": 690,
    "AFE": 691,
    "TKE": 692,
    "SLS": 693,
    "FTI": 694,
    "RSI": 695,
    "IVG": 696,
    "NFK": 697,
    "IPD": 698,
    "VDF": 699,
    "RTF": 700,
    "KTS": 701,
    "TIN": 702,
    "TEK": 703,
    "KKK": 704,
    "FIE": 705,
    "GNI": 706,
    "YNS": 707,
    "PSS": 708,
    "IDA": 709,
    "AAA": 710,
    "VFG": 711,
    "AIL": 712,
    "TIE": 713,
    "GSP": 714,
    "VDE": 715,
    "QLF": 716,
    "GRL": 717,
    "PEE": 718,
    "SRR": 719,
    "AVL": 720,
    "GLA": 721,
    "RIS": 722,
    "LRD": 723,
    "LLI": 724,
    "RNK": 725,
    "DAD": 726,
    "FLN": 727,
    "ARV": 728,
    "KTA": 729,
    "LYS": 730,
    "TDD": 731,
    "GRK": 732,
    "FSL": 733,
    "KSS": 734,
    "VLD": 735,
    "EDR": 736,
    "IPE": 737,
    "GEL": 738,
    "APD": 739,
    "IKI": 740,
    "DDA": 741,
    "INS": 742,
    "PDV": 743,
    "DAV": 744,
    "DLY": 745,
    "DED": 746,
    "PSV": 747,
    "IQI": 748,
    "QKI": 749,
    "SKA": 750,
    "KED": 751,
    "IDG": 752,
    "ISN": 753,
    "INP": 754,
    "IYV": 755,
    "TNL": 756,
    "IAI": 757,
    "DLK": 758,
    "DKY": 759,
    "ILI": 760,
    "GYL": 761,
    "LAV": 762,
    "FKG": 763,
    "LGG": 764,
    "DKT": 765,
    "KKE": 766,
    "YLK": 767,
    "KIN": 768,
    "IFG": 769,
    "INI": 770,
    "NEI": 771,
    "KQF": 772,
    "TGE": 773,
    "RDK": 774,
    "IEF": 775,
    "LVG": 776,
    "FTD": 777,
    "GFD": 778,
    "IID": 779,
    "KTT": 780,
    "YAI": 781,
    "IFE": 782,
    "ANR": 783,
    "STL": 784,
    "SKG": 785,
    "VDK": 786,
    "RQK": 787,
    "DRR": 788,
    "TLP": 789,
    "FNN": 790,
    "NNR": 791,
    "IGT": 792,
    "YGG": 793,
    "FRL": 794,
    "LAR": 795,
    "RIA": 796,
    "QAL": 797,
    "GVV": 798,
    "VVA": 799,
    "LFE": 800,
    "EAN": 801,
    "RLN": 802,
    "VSI": 803,
    "SVL": 804,
    "GYS": 805,
    "IVL": 806,
    "AVK": 807,
    "AAE": 808,
    "PST": 809,
    "PSE": 810,
    "KAE": 811,
    "AEN": 812,
    "PIK": 813,
    "YLS": 814,
    "LRA": 815,
    "IKA": 816,
    "EVE": 817,
    "LIQ": 818,
    "YNE": 819,
    "TSI": 820,
    "NSN": 821,
    "GDI": 822,
    "ALT": 823,
    "IEQ": 824,
    "EEE": 825,
    "LTS": 826,
    "IRL": 827,
    "SLN": 828,
    "NVS": 829,
    "SRK": 830,
    "LGS": 831,
    "ENN": 832,
    "LDE": 833,
    "DDF": 834,
    "FKA": 835,
    "LVY": 836,
    "IAR": 837,
    "NTG": 838,
    "AGK": 839,
    "KIV": 840,
    "RMG": 841,
    "AER": 842,
    "LGR": 843,
    "SID": 844,
    "TDT": 845,
    "NSR": 846,
    "PNE": 847,
    "NSI": 848,
    "FLD": 849,
    "NTK": 850,
    "GLR": 851,
    "DFS": 852,
    "LTA": 853,
    "VEF": 854,
    "VNV": 855,
    "LAQ": 856,
    "SRE": 857,
    "GEA": 858,
    "SQL": 859,
    "GDD": 860,
    "HLP": 861,
    "LPS": 862,
    "DDL": 863,
    "GIS": 864,
    "VKS": 865,
    "DGR": 866,
    "KPN": 867,
    "SKI": 868,
    "IVK": 869,
    "RLA": 870,
    "NLV": 871,
    "NAG": 872,
    "IND": 873,
    "SIE": 874,
    "NNA": 875,
    "NAL": 876,
    "ILR": 877,
    "NPL": 878,
    "SGR": 879,
    "ASS": 880,
    "VRL": 881,
    "SNT": 882,
    "DYL": 883,
    "NET": 884,
    "EKT": 885,
    "LIT": 886,
    "YYG": 887,
    "NSD": 888,
    "VEV": 889,
    "KPI": 890,
    "TKV": 891,
    "IKR": 892,
    "DSS": 893,
    "IVV": 894,
    "NLK": 895,
    "LGV": 896,
    "TKR": 897,
    "DYT": 898,
    "YLY": 899,
    "GSE": 900,
    "VSN": 901,
    "LWL": 902,
    "KNH": 903,
    "YSI": 904,
    "TLV": 905,
    "VWV": 906,
    "TLR": 907,
    "SST": 908,
    "CKE": 909,
    "YRN": 910,
    "LRN": 911,
    "RLY": 912,
    "ENT": 913,
    "VGS": 914,
    "REY": 915,
    "DLS": 916,
    "NSL": 917,
    "LSV": 918,
    "VAV": 919,
    "QGY": 920,
    "LQK": 921,
    "TRS": 922,
    "NFY": 923,
    "QGW": 924,
    "TTR": 925,
    "DFT": 926,
    "LNY": 927,
    "ERE": 928,
    "EAG": 929,
    "HKL": 930,
    "RRR": 931,
    "NGL": 932,
    "RRL": 933,
    "KSQ": 934,
    "NNF": 935,
    "TAH": 936,
    "YRE": 937,
    "TDL": 938,
    "RIL": 939,
    "ILP": 940,
    "EDL": 941,
    "AVP": 942,
    "PEL": 943,
    "GLT": 944,
    "QAK": 945,
    "KGG": 946,
    "IRF": 947,
    "RAV": 948,
    "IRD": 949,
    "SNN": 950,
    "PNL": 951,
    "NLE": 952,
    "ANN": 953,
    "DAE": 954,
    "ALN": 955,
    "TIK": 956,
    "KHK": 957,
    "VKI": 958,
    "SVS": 959,
    "LYI": 960,
    "DNK": 961,
    "VKT": 962,
    "NAF": 963,
    "FES": 964,
    "RFL": 965,
    "SIV": 966,
    "ERY": 967,
    "EVI": 968,
    "SEN": 969,
    "GTP": 970,
    "RAI": 971,
    "AYN": 972,
    "INN": 973,
    "FET": 974,
    "IKQ": 975,
    "VTN": 976,
    "PLI": 977,
    "TER": 978,
    "VNG": 979,
    "PEI": 980,
    "LAA": 981,
    "TNE": 982,
    "AGA": 983,
    "ALA": 984,
    "GSG": 985,
    "IYE": 986,
    "KLQ": 987,
    "SET": 988,
    "FGS": 989,
    "SLA": 990,
    "IER": 991,
    "NRV": 992,
    "VLE": 993,
    "GKS": 994,
    "EVV": 995,
    "ISL": 996,
    "IRN": 997,
    "NPS": 998,
    "NAV": 999,
    "ASR": 1000,
    "TIS": 1001,
    "SLG": 1002,
    "KRN": 1003,
    "SLD": 1004,
    "VIP": 1005,
    "FIA": 1006,
    "EEN": 1007,
    "SNR": 1008,
    "AFK": 1009,
    "YLR": 1010,
    "DYI": 1011,
    "DLD": 1012,
    "VLV": 1013,
    "NNV": 1014,
    "ARL": 1015,
    "SSD": 1016,
    "SRD": 1017,
    "TSL": 1018,
    "TLE": 1019,
    "EHI": 1020,
    "GNF": 1021,
    "PSK": 1022,
    "IIV": 1023
}